___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [3]:
from numpy.random import randn
np.random.seed(101)

In [10]:
randn(5,4)

array([[ 1.60677986, -1.11570997, -1.38537856, -1.32966006],
       [ 0.04145994, -0.4110554 , -0.7713286 ,  0.11047741],
       [-0.80465151,  0.25354804,  0.64914775,  0.35894053],
       [-1.08047146,  0.90239776,  0.16178119,  0.83302932],
       [ 0.97571968, -0.3882387 ,  0.78331605, -0.70895374]])

In [13]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [14]:
df

          W         X         Y         Z
A  0.093628  1.240813 -1.097693 -1.908009
B -0.380104 -1.666059 -2.736995  1.522562
C  0.178009 -0.626805 -0.391089  1.743477
D  1.130018  0.897796  0.330866 -1.063049
E -0.125381 -0.945588  2.029544 -1.046358

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [18]:
df[['W','Z']]

          W         Z
A  0.093628 -1.908009
B -0.380104  1.522562
C  0.178009  1.743477
D  1.130018 -1.063049
E -0.125381 -1.046358

In [188]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [19]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    0.093628
B   -0.380104
C    0.178009
D    1.130018
E   -0.125381
Name: W, dtype: float64

DataFrame Columns are just Series

In [190]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [20]:
df['new'] = df['W'] + df['Y']

In [23]:
df['custom'] = df['X']+df['Y']

In [24]:
df

          W         X         Y         Z       new    custom
A  0.093628  1.240813 -1.097693 -1.908009 -1.004065  0.143120
B -0.380104 -1.666059 -2.736995  1.522562 -3.117098 -4.403054
C  0.178009 -0.626805 -0.391089  1.743477 -0.213080 -1.017894
D  1.130018  0.897796  0.330866 -1.063049  1.460884  1.228662
E -0.125381 -0.945588  2.029544 -1.046358  1.904163  1.083956

** Removing Columns**

In [26]:
df.drop('new',axis=1)

          W         X         Y         Z    custom
A  0.093628  1.240813 -1.097693 -1.908009  0.143120
B -0.380104 -1.666059 -2.736995  1.522562 -4.403054
C  0.178009 -0.626805 -0.391089  1.743477 -1.017894
D  1.130018  0.897796  0.330866 -1.063049  1.228662
E -0.125381 -0.945588  2.029544 -1.046358  1.083956

In [27]:
# Not inplace unless specified!
df

          W         X         Y         Z       new    custom
A  0.093628  1.240813 -1.097693 -1.908009 -1.004065  0.143120
B -0.380104 -1.666059 -2.736995  1.522562 -3.117098 -4.403054
C  0.178009 -0.626805 -0.391089  1.743477 -0.213080 -1.017894
D  1.130018  0.897796  0.330866 -1.063049  1.460884  1.228662
E -0.125381 -0.945588  2.029544 -1.046358  1.904163  1.083956

In [28]:
df.drop('new',axis=1,inplace=True)

In [29]:
df

          W         X         Y         Z    custom
A  0.093628  1.240813 -1.097693 -1.908009  0.143120
B -0.380104 -1.666059 -2.736995  1.522562 -4.403054
C  0.178009 -0.626805 -0.391089  1.743477 -1.017894
D  1.130018  0.897796  0.330866 -1.063049  1.228662
E -0.125381 -0.945588  2.029544 -1.046358  1.083956

Can also drop rows this way:

In [30]:
df.drop('E',axis=0)

          W         X         Y         Z    custom
A  0.093628  1.240813 -1.097693 -1.908009  0.143120
B -0.380104 -1.666059 -2.736995  1.522562 -4.403054
C  0.178009 -0.626805 -0.391089  1.743477 -1.017894
D  1.130018  0.897796  0.330866 -1.063049  1.228662

** Selecting Rows**

In [32]:
df.drop('E',axis=0,inplace=True)

In [35]:
df.loc['C']

W         0.178009
X        -0.626805
Y        -0.391089
Z         1.743477
custom   -1.017894
Name: C, dtype: float64

Or select based off of position instead of label

In [34]:
df.iloc[2]

W         0.178009
X        -0.626805
Y        -0.391089
Z         1.743477
custom   -1.017894
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [36]:
df.loc['B','Y']

-2.7369945956467303

In [38]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.093628 -1.097693
B -0.380104 -2.736995

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [39]:
df

          W         X         Y         Z    custom
A  0.093628  1.240813 -1.097693 -1.908009  0.143120
B -0.380104 -1.666059 -2.736995  1.522562 -4.403054
C  0.178009 -0.626805 -0.391089  1.743477 -1.017894
D  1.130018  0.897796  0.330866 -1.063049  1.228662

In [40]:
df>0

       W      X      Y      Z  custom
A   True   True  False  False    True
B  False  False  False   True   False
C   True  False  False   True   False
D   True   True   True  False    True

In [45]:
df[df>0]

          W         X         Y         Z    custom
A  0.093628  1.240813       NaN       NaN  0.143120
B       NaN       NaN       NaN  1.522562       NaN
C  0.178009       NaN       NaN  1.743477       NaN
D  1.130018  0.897796  0.330866       NaN  1.228662

In [44]:
df[df['Z']<0]

          W         X         Y         Z    custom
A  0.093628  1.240813 -1.097693 -1.908009  0.143120
D  1.130018  0.897796  0.330866 -1.063049  1.228662

In [46]:
df[df['W']>0]['Y']

A   -1.097693
C   -0.391089
D    0.330866
Name: Y, dtype: float64

In [207]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

For two conditions you can use | and & with parenthesis:

In [47]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z, custom]
Index: []

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [48]:
df

          W         X         Y         Z    custom
A  0.093628  1.240813 -1.097693 -1.908009  0.143120
B -0.380104 -1.666059 -2.736995  1.522562 -4.403054
C  0.178009 -0.626805 -0.391089  1.743477 -1.017894
D  1.130018  0.897796  0.330866 -1.063049  1.228662

In [49]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z    custom
0     A  0.093628  1.240813 -1.097693 -1.908009  0.143120
1     B -0.380104 -1.666059 -2.736995  1.522562 -4.403054
2     C  0.178009 -0.626805 -0.391089  1.743477 -1.017894
3     D  1.130018  0.897796  0.330866 -1.063049  1.228662

In [52]:
newind = 'CA NY WY OR'.split()

In [53]:
df['States'] = newind

In [213]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [56]:
df.set_index('States')

               W         X         Y         Z    custom
States
CA      0.093628  1.240813 -1.097693 -1.908009  0.143120
NY     -0.380104 -1.666059 -2.736995  1.522562 -4.403054
WY      0.178009 -0.626805 -0.391089  1.743477 -1.017894
OR      1.130018  0.897796  0.330866 -1.063049  1.228662

In [57]:
df

          W         X         Y         Z    custom States
A  0.093628  1.240813 -1.097693 -1.908009  0.143120     CA
B -0.380104 -1.666059 -2.736995  1.522562 -4.403054     NY
C  0.178009 -0.626805 -0.391089  1.743477 -1.017894     WY
D  1.130018  0.897796  0.330866 -1.063049  1.228662     OR

In [58]:
df.set_index('States',inplace=True)

In [59]:
df

               W         X         Y         Z    custom
States
CA      0.093628  1.240813 -1.097693 -1.908009  0.143120
NY     -0.380104 -1.666059 -2.736995  1.522562 -4.403054
WY      0.178009 -0.626805 -0.391089  1.743477 -1.017894
OR      1.130018  0.897796  0.330866 -1.063049  1.228662

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [60]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [254]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [61]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -1.306482 -1.632924
   2  0.802129 -1.667537
   3  0.608857  0.286473
G2 1 -0.205792  2.493990
   2 -0.547260  0.496727
   3 -1.235614 -0.798428

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [62]:
df.loc['G1']

          A         B
1 -1.306482 -1.632924
2  0.802129 -1.667537
3  0.608857  0.286473

In [63]:
df.loc['G1'].loc[1]

A   -1.306482
B   -1.632924
Name: 1, dtype: float64

In [265]:
df.index.names

FrozenList([None, None])

In [64]:
df.index.names = ['Group','Num']

In [65]:
df

                  A         B
Group Num
G1    1   -1.306482 -1.632924
      2    0.802129 -1.667537
      3    0.608857  0.286473
G2    1   -0.205792  2.493990
      2   -0.547260  0.496727
      3   -1.235614 -0.798428

In [270]:
df.xs('G1')

            A         B
Num
1    0.153661  0.167638
2   -0.765930  0.962299
3    0.902826 -0.537909

In [271]:
df.xs(['G1',1])

A    0.153661
B    0.167638
Name: (G1, 1), dtype: float64

In [273]:
df.xs(1,level='Num')

              A         B
Group
G1     0.153661  0.167638
G2    -1.549671  0.435253

# Great Job!